# MassInstanceUtils Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
MassInstanceUtils Members
MassInstanceUtils Class Methods Properties See Also
---
The MassInstanceUtils type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddMassLevelDataToMassInstance | Create a MassLevelData (Mass Floor) to associate a Level with a mass instance. |
| Dispose | Releases all resources used by the MassInstanceUtils |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetGrossFloorArea | Get the total occupiable floor area represented by a mass instance. |
| GetGrossSurfaceArea | Get the total exterior building surface area represented by a mass instance. |
| GetGrossVolume | Get the total building volume represented by a mass instance. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetJoinedElementIds | Get the ElementIds of Elements that are joined to a mass instance. |
| GetMassLevelDataIds | Get the ElementIds of the MassLevelDatas (Mass Floors) associated with a mass instance. |
| GetMassLevelIds | Get the ElementIds of the Levels associated with a mass instance. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| RemoveMassLevelDataFromMassInstance | Delete the MassLevelData (Mass Floor) that associates a Level with a mass instance. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
MassInstanceUtils Class
Autodesk.Revit.DB Namespace